'~~~~~~~~~~~~~Переменные~~~~~~~~~~~~~'
переменные это ссылки на ячейки памяти где хранятся какие то данные, для дальнейщего использование,при обрашении к нащзванию переменной
num1 = 5 
num2 = 10
print (num1 + num2)# 17
~~~~~~~~~~~~~~~~~~~~~~~~~~~~'Ввод и вывод данных'~~~~~~~~~~~
number = input ('введите число:')
print('введенное число-',number)
#n input- функция которая позволяет принимать данные с терминала 
#print - функция которая позволяет выводить данные в терминал




~~~~~~~~~~~~~~~~~~~~~ 'Правила наименования переменных~~~~~~~~~~~~~~~~~~'
a = 5 #можно, но не совсем понятно 
1num = 10 так нельзя начинать с чисел
hello_world = 'hello world ' #для разделителя  можно использовать только _
print = 'print' # нельзя назвать переменные уже встроенными словами или названиями
#if = 4  не получиться использовать в качестве переменных ключевые слова

# Snake Case- python стиль написания переменных 
hello_world_aaa_bbb = ''

Camel Case-стиль написание переменных во всех других яп
hellooWorldAaaBbb = ''

~~~~~~~~~~~~~~~~~~~~~~ТИПЫ ДАННЫХ в pytnon~~~~~~~~~~~~~~~~~~~~~~~~~

#это неизменяемые типы данных

int_= любое число 17
float_ = 34.0
str_ = "hello "
bool_1 = True
bool_2 = false 
none_ = None
tuple_ = (1,2,3,4,5,6,7,8,9,10)



#изменяемые
list_ = [1,2,3,4,5,6,7,8,9,10]
set_ ={1,2,1,2,4} #{1,2,4}
dict_ = {'a':1,  'b':2, 'c':3,}




